# DropDownOpened Event (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBox..::..DropDownOpened Event
ComboBox Class See Also
---
Subscribe to this event to be notified when the drop-down of the ComboBox is opened.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public event EventHandler<ComboBoxDropDownOpenedEventArgs> DropDownOpened
```

Visual Basic
---
```text
Public Event DropDownOpened As EventHandler(Of ComboBoxDropDownOpenedEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<ComboBoxDropDownOpenedEventArgs^>^ DropDownOpened {
	void add (EventHandler<ComboBoxDropDownOpenedEventArgs^>^ value);
	void remove (EventHandler<ComboBoxDropDownOpenedEventArgs^>^ value);
}
```

# See Also
ComboBox Class
Autodesk.Revit.UI Namespace